If I execute Terraform inside a Docker container, the example runs properly under WSL2 in Windows 10:

<details>
  <summary>Fargate example **succeeds in a Docker container** with module v17.20.0 and Terraform 1.0.8</summary>

```bash
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ curl -L --output 17.zip https://github.com/terraform-aws-modules/terraform-aws-eks/archive/refs/tags/v17.20.0.zip
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   156  100   156    0     0    572      0 --:--:-- --:--:-- --:--:--   571


100  131k    0  131k    0     0   200k      0 --:--:-- --:--:-- --:--:--  200k
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ 
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ unzip 17.zip
Archive:  17.zip
284b038bfda29800d2203d1fce939204c944fd70
   creating: terraform-aws-eks-17.20.0/
   creating: terraform-aws-eks-17.20.0/.chglog/
  inflating: terraform-aws-eks-17.20.0/.chglog/CHANGELOG.tpl.md  
  inflating: terraform-aws-eks-17.20.0/.chglog/config.yml  
  inflating: terraform-aws-eks-17.20.0/.editorconfig  
   creating: terraform-aws-eks-17.20.0/.github/
  inflating: terraform-aws-eks-17.20.0/.github/CONTRIBUTING.md  
  inflating: terraform-aws-eks-17.20.0/.github/ISSUE_TEMPLATE.md  
  inflating: terraform-aws-eks-17.20.0/.github/PULL_REQUEST_TEMPLATE.md  
  inflating: terraform-aws-eks-17.20.0/.github/semantic.yml  
  inflating: terraform-aws-eks-17.20.0/.github/stale.yml  
   creating: terraform-aws-eks-17.20.0/.github/workflows/
  inflating: terraform-aws-eks-17.20.0/.github/workflows/changelog-check.yaml  
  inflating: terraform-aws-eks-17.20.0/.github/workflows/pre-commit.yml  
  inflating: terraform-aws-eks-17.20.0/.gitignore  
  inflating: terraform-aws-eks-17.20.0/.pre-commit-config.yaml  
  inflating: terraform-aws-eks-17.20.0/CHANGELOG.md  
  inflating: terraform-aws-eks-17.20.0/CHANGELOG.pre-v11.0.0.md  
  inflating: terraform-aws-eks-17.20.0/LICENSE  
  inflating: terraform-aws-eks-17.20.0/Makefile  
  inflating: terraform-aws-eks-17.20.0/README.md  
  inflating: terraform-aws-eks-17.20.0/aws_auth.tf  
  inflating: terraform-aws-eks-17.20.0/data.tf  
   creating: terraform-aws-eks-17.20.0/docs/
  inflating: terraform-aws-eks-17.20.0/docs/autoscaling.md  
  inflating: terraform-aws-eks-17.20.0/docs/enable-docker-bridge-network.md  
  inflating: terraform-aws-eks-17.20.0/docs/faq.md  
  inflating: terraform-aws-eks-17.20.0/docs/iam-permissions.md  
  inflating: terraform-aws-eks-17.20.0/docs/spot-instances.md  
  inflating: terraform-aws-eks-17.20.0/docs/upgrades.md  
   creating: terraform-aws-eks-17.20.0/examples/
   creating: terraform-aws-eks-17.20.0/examples/_bootstrap/
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/_bootstrap/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/bottlerocket/
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/userdata.toml  
 extracting: terraform-aws-eks-17.20.0/examples/bottlerocket/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/complete/
  inflating: terraform-aws-eks-17.20.0/examples/complete/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/complete/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/complete/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/complete/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/complete/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/fargate/
  inflating: terraform-aws-eks-17.20.0/examples/fargate/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/fargate/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/fargate/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/fargate/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/fargate/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/instance_refresh/
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/irsa/
  inflating: terraform-aws-eks-17.20.0/examples/irsa/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/cluster-autoscaler-chart-values.yaml  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/irsa.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/locals.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/irsa/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/launch_templates/
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/launch_templates/pre_userdata.sh  
 extracting: terraform-aws-eks-17.20.0/examples/launch_templates/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/disk_encryption_policy.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/launchtemplate.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/outputs.tf  
   creating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/templates/
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/templates/userdata.sh.tpl  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/managed_node_groups/
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/secrets_encryption/
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/versions.tf  
  inflating: terraform-aws-eks-17.20.0/fargate.tf  
  inflating: terraform-aws-eks-17.20.0/irsa.tf  
  inflating: terraform-aws-eks-17.20.0/kubectl.tf  
  inflating: terraform-aws-eks-17.20.0/locals.tf  
  inflating: terraform-aws-eks-17.20.0/main.tf  
   creating: terraform-aws-eks-17.20.0/modules/
   creating: terraform-aws-eks-17.20.0/modules/fargate/
  inflating: terraform-aws-eks-17.20.0/modules/fargate/README.md  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/main.tf  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/variables.tf  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/versions.tf  
   creating: terraform-aws-eks-17.20.0/modules/node_groups/
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/README.md  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/launch_template.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/locals.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/main.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/outputs.tf  
   creating: terraform-aws-eks-17.20.0/modules/node_groups/templates/
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/templates/userdata.sh.tpl  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/variables.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/versions.tf  
  inflating: terraform-aws-eks-17.20.0/node_groups.tf  
  inflating: terraform-aws-eks-17.20.0/outputs.tf  
   creating: terraform-aws-eks-17.20.0/templates/
  inflating: terraform-aws-eks-17.20.0/templates/kubeconfig.tpl  
  inflating: terraform-aws-eks-17.20.0/templates/userdata.sh.tpl  
  inflating: terraform-aws-eks-17.20.0/templates/userdata_windows.tpl  
   creating: terraform-aws-eks-17.20.0/tools/
  inflating: terraform-aws-eks-17.20.0/tools/semtag  
  inflating: terraform-aws-eks-17.20.0/variables.tf  
  inflating: terraform-aws-eks-17.20.0/versions.tf  
  inflating: terraform-aws-eks-17.20.0/workers.tf  
  inflating: terraform-aws-eks-17.20.0/workers_launch_template.tf  
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ 
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ cd terraform-aws-eks-17.20.0
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0$ docker run -v `pwd`:`pwd` -w `pwd` -it -e AWS_SECRET_ACCESS_KEY -e AWS_ACCESS_KEY_ID -e AWS_DEFAULT_REGION --entrypoint /bin/sh hashicorp/terraform:latest
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0 # cd ex
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0 # cd examples/
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples # cd _bootstr
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples # cd _bootstrap/
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap # terraform init
Initializing modules...
Downloading terraform-aws-modules/vpc/aws 3.7.0 for vpc...
- vpc in .terraform/modules/vpc

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/kubernetes versions matching ">= 1.11.0"...
- Finding hashicorp/aws versions matching ">= 3.22.0, >= 3.38.0"...
- Finding hashicorp/random versions matching ">= 2.1.0"...
- Installing hashicorp/random v3.1.0...
- Installed hashicorp/random v3.1.0 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.5.0...
- Installed hashicorp/kubernetes v2.5.0 (signed by HashiCorp)
- Installing hashicorp/aws v3.61.0...
- Installed hashicorp/aws v3.61.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap # terraform app
ly -auto-approv

e

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "bootstrap-example"
        }
      + tags_all = {
          + "Name" = "bootstrap-example"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-private-eu-west-1a"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-private-eu-west-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-private-eu-west-1b"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-private-eu-west-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-private-eu-west-1c"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-private-eu-west-1c"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-public"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.10.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.11.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.12.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "bootstrap-example"
        }
      + tags_all                         = {
          + "Name" = "bootstrap-example"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_name = (known after apply)
  + region       = "eu-west-1"
  + vpc          = {
      + azs                                         = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + cgw_arns                                    = []
      + cgw_ids                                     = []
      + database_internet_gateway_route_id          = ""
      + database_ipv6_egress_route_id               = ""
      + database_nat_gateway_route_ids              = []
      + database_network_acl_arn                    = ""
      + database_network_acl_id                     = ""
      + database_route_table_association_ids        = []
      + database_route_table_ids                    = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + database_subnet_arns                        = []
      + database_subnet_group                       = ""
      + database_subnet_group_name                  = ""
      + database_subnets                            = []
      + database_subnets_cidr_blocks                = []
      + database_subnets_ipv6_cidr_blocks           = []
      + default_network_acl_id                      = (known after apply)
      + default_route_table_id                      = (known after apply)
      + default_security_group_id                   = (known after apply)
      + default_vpc_arn                             = ""
      + default_vpc_cidr_block                      = ""
      + default_vpc_default_network_acl_id          = ""
      + default_vpc_default_route_table_id          = ""
      + default_vpc_default_security_group_id       = ""
      + default_vpc_enable_dns_hostnames            = ""
      + default_vpc_enable_dns_support              = ""
      + default_vpc_id                              = ""
      + default_vpc_instance_tenancy                = ""
      + default_vpc_main_route_table_id             = ""
      + dhcp_options_id                             = ""
      + egress_only_internet_gateway_id             = ""
      + elasticache_network_acl_arn                 = ""
      + elasticache_network_acl_id                  = ""
      + elasticache_route_table_association_ids     = []
      + elasticache_route_table_ids                 = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + elasticache_subnet_arns                     = []
      + elasticache_subnet_group                    = ""
      + elasticache_subnet_group_name               = ""
      + elasticache_subnets                         = []
      + elasticache_subnets_cidr_blocks             = []
      + elasticache_subnets_ipv6_cidr_blocks        = []
      + igw_arn                                     = (known after apply)
      + igw_id                                      = (known after apply)
      + intra_network_acl_arn                       = ""
      + intra_network_acl_id                        = ""
      + intra_route_table_association_ids           = []
      + intra_route_table_ids                       = []
      + intra_subnet_arns                           = []
      + intra_subnets                               = []
      + intra_subnets_cidr_blocks                   = []
      + intra_subnets_ipv6_cidr_blocks              = []
      + name                                        = "bootstrap-example"
      + nat_ids                                     = []
      + nat_public_ips                              = []
      + natgw_ids                                   = []
      + outpost_network_acl_arn                     = ""
      + outpost_network_acl_id                      = ""
      + outpost_subnet_arns                         = []
      + outpost_subnets                             = []
      + outpost_subnets_cidr_blocks                 = []
      + outpost_subnets_ipv6_cidr_blocks            = []
      + private_ipv6_egress_route_ids               = []
      + private_nat_gateway_route_ids               = []
      + private_network_acl_arn                     = ""
      + private_network_acl_id                      = ""
      + private_route_table_association_ids         = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_route_table_ids                     = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_subnet_arns                         = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_subnets                             = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_subnets_cidr_blocks                 = [
          + "10.0.10.0/24",
          + "10.0.11.0/24",
          + "10.0.12.0/24",
        ]
      + private_subnets_ipv6_cidr_blocks            = [
          + null,
          + null,
          + null,
        ]
      + public_internet_gateway_ipv6_route_id       = ""
      + public_internet_gateway_route_id            = (known after apply)
      + public_network_acl_arn                      = ""
      + public_network_acl_id                       = ""
      + public_route_table_association_ids          = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + public_route_table_ids                      = [
          + (known after apply),
        ]
      + public_subnet_arns                          = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + public_subnets                              = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + public_subnets_cidr_blocks                  = [
          + "10.0.0.0/24",
          + "10.0.1.0/24",
          + "10.0.2.0/24",
        ]
      + public_subnets_ipv6_cidr_blocks             = [
          + null,
          + null,
          + null,
        ]
      + redshift_network_acl_arn                    = ""
      + redshift_network_acl_id                     = ""
      + redshift_public_route_table_association_ids = []
      + redshift_route_table_association_ids        = []
      + redshift_route_table_ids                    = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + redshift_subnet_arns                        = []
      + redshift_subnet_group                       = ""
      + redshift_subnets                            = []
      + redshift_subnets_cidr_blocks                = []
      + redshift_subnets_ipv6_cidr_blocks           = []
      + this_customer_gateway                       = {}
      + vgw_arn                                     = ""
      + vgw_id                                      = ""
      + vpc_arn                                     = (known after apply)
      + vpc_cidr_block                              = "10.0.0.0/16"
      + vpc_enable_dns_hostnames                    = true
      + vpc_enable_dns_support                      = true
      + vpc_flow_log_cloudwatch_iam_role_arn        = ""
      + vpc_flow_log_destination_arn                = ""
      + vpc_flow_log_destination_type               = "cloud-watch-logs"
      + vpc_flow_log_id                             = ""
      + vpc_id                                      = (known after apply)
      + vpc_instance_tenancy                        = "default"
      + vpc_ipv6_association_id                     = (known after apply)
      + vpc_ipv6_cidr_block                         = (known after apply)
      + vpc_main_route_table_id                     = (known after apply)
      + vpc_owner_id                                = (known after apply)
      + vpc_secondary_cidr_blocks                   = []
    }
random_string.suffix: Creating...
random_string.suffix: Creation complete after 0s [id=3yd9EsUB]
module.vpc.aws_vpc.this[0]: Creating...
module.vpc.aws_vpc.this[0]: Still creating... [10s elapsed]
module.vpc.aws_vpc.this[0]: Still creating... [20s elapsed]
module.vpc.aws_vpc.this[0]: Creation complete after 21s [id=vpc-0777a66895b8c1561]
module.vpc.aws_route_table.private[0]: Creating...
module.vpc.aws_subnet.public[1]: Creating...
module.vpc.aws_subnet.private[0]: Creating...
module.vpc.aws_subnet.private[2]: Creating...
module.vpc.aws_route_table.public[0]: Creating...
module.vpc.aws_subnet.public[0]: Creating...
module.vpc.aws_route_table.private[2]: Creating...
module.vpc.aws_internet_gateway.this[0]: Creating...
module.vpc.aws_subnet.private[1]: Creating...
module.vpc.aws_route_table.private[1]: Creating...
module.vpc.aws_route_table.private[1]: Creation complete after 3s [id=rtb-01e04d4df56bcd216]
module.vpc.aws_subnet.public[2]: Creating...
module.vpc.aws_route_table.public[0]: Creation complete after 3s [id=rtb-08beaaeac5447bb19]
module.vpc.aws_route_table.private[0]: Creation complete after 3s [id=rtb-091755c1bbe19cf0f]
module.vpc.aws_route_table.private[2]: Creation complete after 3s [id=rtb-001b619d35609340d]
module.vpc.aws_subnet.private[1]: Creation complete after 4s [id=subnet-0cd558a5fd321301e]
module.vpc.aws_subnet.private[2]: Creation complete after 4s [id=subnet-05278a2d8254137aa]
module.vpc.aws_subnet.private[0]: Creation complete after 4s [id=subnet-062a2c6b0f0a14e19]
module.vpc.aws_route_table_association.private[0]: Creating...
module.vpc.aws_route_table_association.private[2]: Creating...
module.vpc.aws_route_table_association.private[1]: Creating...
module.vpc.aws_internet_gateway.this[0]: Creation complete after 4s [id=igw-0b4bc43a79bf6e5d1]
module.vpc.aws_route.public_internet_gateway[0]: Creating...
module.vpc.aws_route_table_association.private[1]: Creation complete after 2s [id=rtbassoc-00148c99f29267f19]
module.vpc.aws_route_table_association.private[2]: Creation complete after 2s [id=rtbassoc-071fb0db3a17b0c79]
module.vpc.aws_route_table_association.private[0]: Creation complete after 2s [id=rtbassoc-0ec7210c6c48f047d]
module.vpc.aws_route.public_internet_gateway[0]: Creation complete after 3s [id=r-rtb-08beaaeac5447bb191080289494]
module.vpc.aws_subnet.public[1]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[0]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[2]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[1]: Creation complete after 15s [id=subnet-07177f0122543ee7f]
module.vpc.aws_subnet.public[0]: Creation complete after 15s [id=subnet-055d44d3006306cb9]
module.vpc.aws_subnet.public[2]: Creation complete after 14s [id=subnet-00453ea865d2b0fda]
module.vpc.aws_route_table_association.public[1]: Creating...
module.vpc.aws_route_table_association.public[2]: Creating...
module.vpc.aws_route_table_association.public[0]: Creating...
module.vpc.aws_route_table_association.public[0]: Creation complete after 2s [id=rtbassoc-002e5006f3fe7aaa4]
module.vpc.aws_route_table_association.public[1]: Creation complete after 2s [id=rtbassoc-075eafe123c96bdc6]
module.vpc.aws_route_table_association.public[2]: Creation complete after 2s [id=rtbassoc-0ddbfa66240461ded]

Apply complete! Resources: 20 added, 0 changed, 0 destroyed.

Outputs:

cluster_name = "test-eks-3yd9EsUB"
region = "eu-west-1"
vpc = {
  "azs" = tolist([
    "eu-west-1a",
    "eu-west-1b",
    "eu-west-1c",
  ])
  "cgw_arns" = []
  "cgw_ids" = []
  "database_internet_gateway_route_id" = ""
  "database_ipv6_egress_route_id" = ""
  "database_nat_gateway_route_ids" = []
  "database_network_acl_arn" = ""
  "database_network_acl_id" = ""
  "database_route_table_association_ids" = []
  "database_route_table_ids" = tolist([
    "rtb-091755c1bbe19cf0f",
    "rtb-01e04d4df56bcd216",
    "rtb-001b619d35609340d",
  ])
  "database_subnet_arns" = []
  "database_subnet_group" = ""
  "database_subnet_group_name" = ""
  "database_subnets" = []
  "database_subnets_cidr_blocks" = []
  "database_subnets_ipv6_cidr_blocks" = []
  "default_network_acl_id" = "acl-02e25bdeaf5c43707"
  "default_route_table_id" = "rtb-0bc3280a5e36846ac"
  "default_security_group_id" = "sg-04fe2652b9e061357"
  "default_vpc_arn" = ""
  "default_vpc_cidr_block" = ""
  "default_vpc_default_network_acl_id" = ""
  "default_vpc_default_route_table_id" = ""
  "default_vpc_default_security_group_id" = ""
  "default_vpc_enable_dns_hostnames" = ""
  "default_vpc_enable_dns_support" = ""
  "default_vpc_id" = ""
  "default_vpc_instance_tenancy" = ""
  "default_vpc_main_route_table_id" = ""
  "dhcp_options_id" = ""
  "egress_only_internet_gateway_id" = ""
  "elasticache_network_acl_arn" = ""
  "elasticache_network_acl_id" = ""
  "elasticache_route_table_association_ids" = []
  "elasticache_route_table_ids" = tolist([
    "rtb-091755c1bbe19cf0f",
    "rtb-01e04d4df56bcd216",
    "rtb-001b619d35609340d",
  ])
  "elasticache_subnet_arns" = []
  "elasticache_subnet_group" = ""
  "elasticache_subnet_group_name" = ""
  "elasticache_subnets" = []
  "elasticache_subnets_cidr_blocks" = []
  "elasticache_subnets_ipv6_cidr_blocks" = []
  "igw_arn" = "arn:aws:ec2:eu-west-1:645945852371:internet-gateway/igw-0b4bc43a79bf6e5d1"
  "igw_id" = "igw-0b4bc43a79bf6e5d1"
  "intra_network_acl_arn" = ""
  "intra_network_acl_id" = ""
  "intra_route_table_association_ids" = []
  "intra_route_table_ids" = []
  "intra_subnet_arns" = []
  "intra_subnets" = []
  "intra_subnets_cidr_blocks" = []
  "intra_subnets_ipv6_cidr_blocks" = []
  "name" = "bootstrap-example"
  "nat_ids" = []
  "nat_public_ips" = tolist([])
  "natgw_ids" = []
  "outpost_network_acl_arn" = ""
  "outpost_network_acl_id" = ""
  "outpost_subnet_arns" = []
  "outpost_subnets" = []
  "outpost_subnets_cidr_blocks" = []
  "outpost_subnets_ipv6_cidr_blocks" = []
  "private_ipv6_egress_route_ids" = []
  "private_nat_gateway_route_ids" = []
  "private_network_acl_arn" = ""
  "private_network_acl_id" = ""
  "private_route_table_association_ids" = [
    "rtbassoc-0ec7210c6c48f047d",
    "rtbassoc-00148c99f29267f19",
    "rtbassoc-071fb0db3a17b0c79",
  ]
  "private_route_table_ids" = [
    "rtb-091755c1bbe19cf0f",
    "rtb-01e04d4df56bcd216",
    "rtb-001b619d35609340d",
  ]
  "private_subnet_arns" = [
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-062a2c6b0f0a14e19",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-0cd558a5fd321301e",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-05278a2d8254137aa",
  ]
  "private_subnets" = [
    "subnet-062a2c6b0f0a14e19",
    "subnet-0cd558a5fd321301e",
    "subnet-05278a2d8254137aa",
  ]
  "private_subnets_cidr_blocks" = [
    "10.0.10.0/24",
    "10.0.11.0/24",
    "10.0.12.0/24",
  ]
  "private_subnets_ipv6_cidr_blocks" = [
    tostring(null),
    tostring(null),
    tostring(null),
  ]
  "public_internet_gateway_ipv6_route_id" = ""
  "public_internet_gateway_route_id" = "r-rtb-08beaaeac5447bb191080289494"
  "public_network_acl_arn" = ""
  "public_network_acl_id" = ""
  "public_route_table_association_ids" = [
    "rtbassoc-002e5006f3fe7aaa4",
    "rtbassoc-075eafe123c96bdc6",
    "rtbassoc-0ddbfa66240461ded",
  ]
  "public_route_table_ids" = [
    "rtb-08beaaeac5447bb19",
  ]
  "public_subnet_arns" = [
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-055d44d3006306cb9",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-07177f0122543ee7f",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-00453ea865d2b0fda",
  ]
  "public_subnets" = [
    "subnet-055d44d3006306cb9",
    "subnet-07177f0122543ee7f",
    "subnet-00453ea865d2b0fda",
  ]
  "public_subnets_cidr_blocks" = [
    "10.0.0.0/24",
    "10.0.1.0/24",
    "10.0.2.0/24",
  ]
  "public_subnets_ipv6_cidr_blocks" = [
    tostring(null),
    tostring(null),
    tostring(null),
  ]
  "redshift_network_acl_arn" = ""
  "redshift_network_acl_id" = ""
  "redshift_public_route_table_association_ids" = []
  "redshift_route_table_association_ids" = []
  "redshift_route_table_ids" = tolist([
    "rtb-091755c1bbe19cf0f",
    "rtb-01e04d4df56bcd216",
    "rtb-001b619d35609340d",
  ])
  "redshift_subnet_arns" = []
  "redshift_subnet_group" = ""
  "redshift_subnets" = []
  "redshift_subnets_cidr_blocks" = []
  "redshift_subnets_ipv6_cidr_blocks" = []
  "this_customer_gateway" = {}
  "vgw_arn" = ""
  "vgw_id" = ""
  "vpc_arn" = "arn:aws:ec2:eu-west-1:645945852371:vpc/vpc-0777a66895b8c1561"
  "vpc_cidr_block" = "10.0.0.0/16"
  "vpc_enable_dns_hostnames" = true
  "vpc_enable_dns_support" = true
  "vpc_flow_log_cloudwatch_iam_role_arn" = ""
  "vpc_flow_log_destination_arn" = ""
  "vpc_flow_log_destination_type" = "cloud-watch-logs"
  "vpc_flow_log_id" = ""
  "vpc_id" = "vpc-0777a66895b8c1561"
  "vpc_instance_tenancy" = "default"
  "vpc_ipv6_association_id" = ""
  "vpc_ipv6_cidr_block" = ""
  "vpc_main_route_table_id" = "rtb-0bc3280a5e36846ac"
  "vpc_owner_id" = "645945852371"
  "vpc_secondary_cidr_blocks" = []
}
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap # 
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap # terraform apply -auto-approv

/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap # terraform app
version
Terraform v1.0.8
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v3.61.0
+ provider registry.terraform.io/hashicorp/kubernetes v2.5.0
+ provider registry.terraform.io/hashicorp/random v3.1.0
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap # cd ../far
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap # cd ../fargate/
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/fargate # terraform init
Initializing modules...
- barebone_eks in ../..
- barebone_eks.fargate in ../../modules/fargate
- barebone_eks.node_groups in ../../modules/node_groups
- eks in ../..
- eks.fargate in ../../modules/fargate
- eks.node_groups in ../../modules/node_groups
- fargate_profile_existing_cluster in ../../modules/fargate

Initializing the backend...

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding terraform-aws-modules/http versions matching ">= 2.4.1"...
- Finding hashicorp/aws versions matching ">= 3.22.0, >= 3.40.0, >= 3.56.0"...
- Finding hashicorp/local versions matching ">= 1.4.0"...
- Finding hashicorp/random versions matching ">= 2.1.0"...
- Finding hashicorp/kubernetes versions matching ">= 1.11.0, >= 1.11.1"...
- Finding hashicorp/cloudinit versions matching ">= 2.0.0"...
- Installing terraform-aws-modules/http v2.4.1...
- Installed terraform-aws-modules/http v2.4.1 (self-signed, key ID B2C1C0641B6B0EB7)
- Installing hashicorp/aws v3.61.0...
^[[B^[[A- Installed hashicorp/aws v3.61.0 (signed by HashiCorp)
- Installing hashicorp/local v2.1.0...
- Installed hashicorp/local v2.1.0 (signed by HashiCorp)
- Installing hashicorp/random v3.1.0...
- Installed hashicorp/random v3.1.0 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.5.0...
- Installed hashicorp/kubernetes v2.5.0 (signed by HashiCorp)
- Installing hashicorp/cloudinit v2.2.0...
- Installed hashicorp/cloudinit v2.2.0 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/fargate # 
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/fargate # terraform init
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/fargate # terraform version
Terraform v1.0.8
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v3.61.0
+ provider registry.terraform.io/hashicorp/cloudinit v2.2.0
+ provider registry.terraform.io/hashicorp/kubernetes v2.5.0
+ provider registry.terraform.io/hashicorp/local v2.1.0
+ provider registry.terraform.io/hashicorp/random v3.1.0
+ provider registry.terraform.io/terraform-aws-modules/http v2.4.1
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/fargate # terraform apply -autoapprove
╷
│ Error: Failed to parse command-line flags
│ 
│ flag provided but not defined: -autoapprove
╵

For more help on using this command, run:
  terraform apply -help
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/fargate # 
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/fargate # terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.barebone will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "barebone"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.barebone will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "barebone"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.barebone_eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = (known after apply)
    }

  # module.barebone_eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "barebone-test-eks-3yd9EsUB"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all              = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + version               = "1.21"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-05278a2d8254137aa",
              + "subnet-062a2c6b0f0a14e19",
              + "subnet-0cd558a5fd321301e",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.barebone_eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "barebone-test-eks-3yd9EsUB-elb-sl-role-creation"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all    = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
    }

  # module.barebone_eks.aws_iam_role.cluster[0] will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "barebone-test-eks-3yd9EsUB"
      + path                  = "/"
      + tags                  = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all              = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.barebone_eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "barebone-test-eks-3yd9EsUB"
      + path                  = "/"
      + tags                  = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all              = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "barebone-test-eks-3yd9EsUB"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
          + "Name"        = "barebone-test-eks-3yd9EsUB-eks_cluster_sg"
        }
      + tags_all               = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
          + "Name"        = "barebone-test-eks-3yd9EsUB-eks_cluster_sg"
        }
      + vpc_id                 = "vpc-0777a66895b8c1561"
    }

  # module.barebone_eks.aws_security_group.workers[0] will be created
  + resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "barebone-test-eks-3yd9EsUB"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Barebone"                                         = "yes_please"
          + "Environment"                                      = "test"
          + "Name"                                             = "barebone-test-eks-3yd9EsUB-eks_worker_sg"
          + "kubernetes.io/cluster/barebone-test-eks-3yd9EsUB" = "owned"
        }
      + tags_all               = {
          + "Barebone"                                         = "yes_please"
          + "Environment"                                      = "test"
          + "Name"                                             = "barebone-test-eks-3yd9EsUB-eks_worker_sg"
          + "kubernetes.io/cluster/barebone-test-eks-3yd9EsUB" = "owned"
        }
      + vpc_id                 = "vpc-0777a66895b8c1561"
    }

  # module.barebone_eks.aws_security_group_rule.cluster_egress_internet[0] will be created
  + resource "aws_security_group_rule" "cluster_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster egress access to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.barebone_eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + description              = "Allow pods to communicate with the EKS cluster API."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_egress_internet[0] will be created
  + resource "aws_security_group_rule" "workers_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes all egress to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_ingress_cluster[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster" {
      + description              = "Allow workers pods to receive communication from the cluster control plane."
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_ingress_self[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.barebone_eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = jsonencode([])
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.barebone_eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_barebone-test-eks-3yd9EsUB"
      + id                   = (known after apply)
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "test-eks-3yd9EsUB"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + version               = "1.21"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-062a2c6b0f0a14e19",
              + "subnet-07177f0122543ee7f",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "test-eks-3yd9EsUB-elb-sl-role-creation"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all    = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
    }

  # module.eks.aws_iam_role.cluster[0] will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test-eks-3yd9EsUB"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test-eks-3yd9EsUB"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-eks-3yd9EsUB"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Name"        = "test-eks-3yd9EsUB-eks_cluster_sg"
        }
      + tags_all               = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Name"        = "test-eks-3yd9EsUB-eks_cluster_sg"
        }
      + vpc_id                 = "vpc-0777a66895b8c1561"
    }

  # module.eks.aws_security_group.workers[0] will be created
  + resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-eks-3yd9EsUB"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"                             = "test"
          + "GithubOrg"                               = "terraform-aws-modules"
          + "GithubRepo"                              = "terraform-aws-eks"
          + "Name"                                    = "test-eks-3yd9EsUB-eks_worker_sg"
          + "kubernetes.io/cluster/test-eks-3yd9EsUB" = "owned"
        }
      + tags_all               = {
          + "Environment"                             = "test"
          + "GithubOrg"                               = "terraform-aws-modules"
          + "GithubRepo"                              = "terraform-aws-eks"
          + "Name"                                    = "test-eks-3yd9EsUB-eks_worker_sg"
          + "kubernetes.io/cluster/test-eks-3yd9EsUB" = "owned"
        }
      + vpc_id                 = "vpc-0777a66895b8c1561"
    }

  # module.eks.aws_security_group_rule.cluster_egress_internet[0] will be created
  + resource "aws_security_group_rule" "cluster_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster egress access to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + description              = "Allow pods to communicate with the EKS cluster API."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_egress_internet[0] will be created
  + resource "aws_security_group_rule" "workers_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes all egress to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster" {
      + description              = "Allow workers pods to receive communication from the cluster control plane."
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_self[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_test-eks-3yd9EsUB"
      + id                   = (known after apply)
    }

  # module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = (known after apply)
      + fargate_profile_name   = "profile1"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-062a2c6b0f0a14e19",
          + "subnet-0cd558a5fd321301e",
        ]
      + tags                   = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile1"
        }
      + tags_all               = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile1"
        }

      + selector {
          + labels    = {
              + "WorkerType" = "fargate"
            }
          + namespace = "profile"
        }
      + selector {
          + labels    = {
              + "k8s-app" = "kube-dns"
            }
          + namespace = "kube-system"
        }
    }

  # module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = (known after apply)
      + fargate_profile_name   = "profile2"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0cd558a5fd321301e",
        ]
      + tags                   = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile2"
        }
      + tags_all               = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile2"
        }

      + selector {
          + labels    = {
              + "Fargate" = "profile2"
            }
          + namespace = "default"
        }
    }

  # module.fargate_profile_existing_cluster.aws_iam_role.eks_fargate_pod[0] will be created
  + resource "aws_iam_role" "eks_fargate_pod" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "DoYouLoveFargate" = "Yes"
        }
      + tags_all              = {
          + "DoYouLoveFargate" = "Yes"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.fargate_profile_existing_cluster.aws_iam_role_policy_attachment.eks_fargate_pod[0] will be created
  + resource "aws_iam_role_policy_attachment" "eks_fargate_pod" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.fargate.aws_eks_fargate_profile.this["default"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "test-eks-3yd9EsUB"
      + fargate_profile_name   = "default"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-05278a2d8254137aa",
        ]
      + tags                   = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "default"
        }
      + tags_all               = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "default"
        }

      + selector {
          + labels    = {
              + "WorkerType" = "fargate"
            }
          + namespace = "default"
        }
      + selector {
          + labels    = {
              + "k8s-app" = "kube-dns"
            }
          + namespace = "kube-system"
        }
    }

  # module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "test-eks-3yd9EsUB"
      + fargate_profile_name   = "secondary"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0cd558a5fd321301e",
        ]
      + tags                   = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "secondary"
        }
      + tags_all               = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "secondary"
        }

      + selector {
          + labels    = {
              + "Environment" = "test"
              + "GithubOrg"   = "terraform-aws-modules"
              + "GithubRepo"  = "terraform-aws-eks"
            }
          + namespace = "default"
        }
    }

  # module.eks.module.fargate.aws_iam_role.eks_fargate_pod[0] will be created
  + resource "aws_iam_role" "eks_fargate_pod" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test-eks-3yd9EsUB-fargate"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.fargate.aws_iam_role_policy_attachment.eks_fargate_pod[0] will be created
  + resource "aws_iam_role_policy_attachment" "eks_fargate_pod" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

Plan: 49 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_endpoint          = (known after apply)
  + cluster_security_group_id = (known after apply)
  + config_map_aws_auth       = []
  + fargate_profile_arns      = [
      + (known after apply),
      + (known after apply),
    ]
  + kubectl_config            = (known after apply)
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creating...
module.barebone_eks.aws_security_group.cluster[0]: Creating...
module.eks.aws_security_group.workers[0]: Creating...
module.eks.aws_security_group.cluster[0]: Creating...
module.barebone_eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creating...
module.eks.aws_iam_role.cluster[0]: Creating...
module.barebone_eks.aws_iam_role.cluster[0]: Creating...
module.barebone_eks.aws_security_group.workers[0]: Creating...
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creation complete after 2s [id=arn:aws:iam::645945852371:policy/test-eks-3yd9EsUB-elb-sl-role-creation20211002171505466600000001]
module.barebone_eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creation complete after 2s [id=arn:aws:iam::645945852371:policy/barebone-test-eks-3yd9EsUB-elb-sl-role-creation20211002171505470800000005]
module.eks.aws_iam_role.cluster[0]: Creation complete after 3s [id=test-eks-3yd9EsUB20211002171505472200000007]
module.barebone_eks.aws_iam_role.cluster[0]: Creation complete after 3s [id=barebone-test-eks-3yd9EsUB20211002171505470000000003]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creating...
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creating...
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creating...
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creating...
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creation complete after 1s [id=test-eks-3yd9EsUB20211002171505472200000007-2021100217150849190000000c]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creation complete after 1s [id=test-eks-3yd9EsUB20211002171505472200000007-2021100217150849190000000d]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creation complete after 1s [id=test-eks-3yd9EsUB20211002171505472200000007-20211002171508482200000009]
module.barebone_eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creation complete after 1s [id=barebone-test-eks-3yd9EsUB20211002171505470000000003-2021100217150851380000000e]
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creation complete after 1s [id=barebone-test-eks-3yd9EsUB20211002171505470000000003-2021100217150848610000000b]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creation complete after 1s [id=test-eks-3yd9EsUB20211002171505472200000007-2021100217150848220000000a]
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creation complete after 1s [id=barebone-test-eks-3yd9EsUB20211002171505470000000003-2021100217150978670000000f]
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creation complete after 1s [id=barebone-test-eks-3yd9EsUB20211002171505470000000003-20211002171509786800000010]
module.eks.aws_security_group.cluster[0]: Creation complete after 6s [id=sg-0792d5490e6869910]
module.eks.aws_security_group.workers[0]: Creation complete after 6s [id=sg-0a8d41d91540fce42]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Creating...
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_self[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creating...
module.barebone_eks.aws_security_group.workers[0]: Creation complete after 6s [id=sg-04653fe87b1a59fd0]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creating...
module.barebone_eks.aws_security_group.cluster[0]: Creation complete after 6s [id=sg-05f54225ffbda2522]
module.barebone_eks.aws_security_group_rule.workers_ingress_self[0]: Creating...
module.barebone_eks.aws_security_group_rule.workers_egress_internet[0]: Creating...
module.barebone_eks.aws_security_group_rule.cluster_egress_internet[0]: Creating...
module.barebone_eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creating...
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Creation complete after 2s [id=sgrule-1077825710]
module.barebone_eks.aws_security_group_rule.workers_egress_internet[0]: Creation complete after 2s [id=sgrule-2030238107]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Creation complete after 2s [id=sgrule-1559363306]
module.barebone_eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creation complete after 2s [id=sgrule-1149023595]
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster[0]: Creating...
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creating...
module.barebone_eks.aws_security_group_rule.workers_ingress_self[0]: Creation complete after 5s [id=sgrule-1676463046]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creation complete after 5s [id=sgrule-1972114919]
module.barebone_eks.aws_security_group_rule.cluster_egress_internet[0]: Creation complete after 5s [id=sgrule-1989876543]
module.barebone_eks.aws_eks_cluster.this[0]: Creating...
module.eks.aws_eks_cluster.this[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Creation complete after 5s [id=sgrule-235166267]
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster[0]: Creation complete after 5s [id=sgrule-1170577755]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creation complete after 8s [id=sgrule-2662966000]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Still creating... [10s elapsed]
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creation complete after 8s [id=sgrule-750288309]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Creation complete after 10s [id=sgrule-1360118050]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [1m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [2m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [3m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [3m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [4m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [4m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [5m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [5m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [6m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [6m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [7m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [7m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [8m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [8m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [9m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [9m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m0s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [10m50s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [10m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Creation complete after 10m59s [id=test-eks-3yd9EsUB]
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster.cluster: Reading...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=test-eks-3yd9EsUB]
module.eks.local_file.kubeconfig[0]: Creating...
module.eks.aws_iam_role.workers[0]: Creating...
module.eks.module.fargate.aws_iam_role.eks_fargate_pod[0]: Creating...
module.eks.local_file.kubeconfig[0]: Creation complete after 0s [id=f320ec57ad390e2145c8206865404bd3045c858e]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [11m0s elapsed]
data.aws_eks_cluster.cluster: Read complete after 0s [id=test-eks-3yd9EsUB]
module.eks.aws_iam_role.workers[0]: Creation complete after 2s [id=test-eks-3yd9EsUB20211002172615581100000011]
module.eks.module.fargate.aws_iam_role.eks_fargate_pod[0]: Creation complete after 2s [id=test-eks-3yd9EsUB-fargate20211002172615581100000012]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Creating...
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Creating...
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Creating...
module.eks.module.fargate.aws_iam_role_policy_attachment.eks_fargate_pod[0]: Creating...
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Creating...
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Creating...
module.eks.module.fargate.aws_iam_role_policy_attachment.eks_fargate_pod[0]: Creation complete after 1s [id=test-eks-3yd9EsUB-fargate20211002172615581100000012-20211002172618578100000015]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Creation complete after 1s [id=test-eks-3yd9EsUB20211002172615581100000011-20211002172618586700000016]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Creation complete after 1s [id=test-eks-3yd9EsUB20211002172615581100000011-20211002172618592800000017]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Creation complete after 1s [id=test-eks-3yd9EsUB20211002172615581100000011-20211002172618606300000018]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [11m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [10s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [11m20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [20s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [11m30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [30s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Still creating... [11m40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [40s elapsed]
module.barebone_eks.aws_eks_cluster.this[0]: Creation complete after 11m47s [id=barebone-test-eks-3yd9EsUB]
module.barebone_eks.data.http.wait_for_cluster[0]: Reading...
module.barebone_eks.local_file.kubeconfig[0]: Creating...
module.barebone_eks.aws_iam_role.workers[0]: Creating...
module.barebone_eks.local_file.kubeconfig[0]: Creation complete after 0s [id=eafb16afd56f8ebd4dc888b2b8140f78c25f503c]
mo^[[20;101R^[[20;110R^[[20;121R^[[20;121R^[[20;121R^[[20;121R^[[20;118R^[[20;118R^[[20;118Rdule.barebone_eks.data.http.wait_for_cluster[0]: Read complete after 1s [id=https://59F7CC00D77D956E96771C7EB056D468.yl4.eu-west-1.eks.amazonaws.com/healthz]
data.aws_eks_cluster_auth.barebone: Reading...
data.aws_eks_cluster.barebone: Reading...
data.aws_eks_cluster_auth.barebone: Read complete after 0s [id=barebone-test-eks-3yd9EsUB]
module.fargate_profile_existing_cluster.aws_iam_role.eks_fargate_pod[0]: Creating...
data.aws_eks_cluster.barebone: Read complete after 1s [id=barebone-test-eks-3yd9EsUB]
module.barebone_eks.aws_iam_role.workers[0]: Creation complete after 2s [id=barebone-test-eks-3yd9EsUB20211002172703262000000019]
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Creating...
module.barebone_eks.kubernetes_config_map.aws_auth[0]: Creating...
module.fargate_profile_existing_cluster.aws_iam_role.eks_fargate_pod[0]: Creation complete after 2s [id=barebone-test-eks-3yd9Es-fargate2021100217270405910000001a]
module.fargate_profile_existing_cluster.aws_iam_role_policy_attachment.eks_fargate_pod[0]: Creating...
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Creating...
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Creation complete after 2s [id=barebone-test-eks-3yd9EsUB20211002172703262000000019-2021100217270620510000001e]
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Creation complete after 2s [id=barebone-test-eks-3yd9EsUB20211002172703262000000019-2021100217270622090000001f]
module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Creation complete after 2s [id=barebone-test-eks-3yd9EsUB20211002172703262000000019-2021100217270620510000001d]
module.barebone_eks.kubernetes_config_map.aws_auth[0]: Creation complete after 2s [id=kube-system/aws-auth]
module.fargate_profile_existing_cluster.aws_iam_role_policy_attachment.eks_fargate_pod[0]: Creation complete after 1s [id=barebone-test-eks-3yd9Es-fargate2021100217270405910000001a-20211002172706826700000020]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [1m50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [1m50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [2m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [2m10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [2m20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [2m30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [1m50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [1m50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [2m40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [2m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [2m50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [2m50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [2m10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [3m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [2m20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [3m10s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Still creating... [2m30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [3m20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"]: Creation complete after 2m39s [id=barebone-test-eks-3yd9EsUB:profile2]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [3m30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [2m50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [3m40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [3m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [3m50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [3m50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [3m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [4m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [4m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [3m20s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [4m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Still creating... [4m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"]: Creation complete after 4m10s [id=test-eks-3yd9EsUB:secondary]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [3m30s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [4m20s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [3m40s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [4m30s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [3m50s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [4m40s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [4m0s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [4m50s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Still creating... [4m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [5m0s elapsed]
module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"]: Creation complete after 4m16s [id=barebone-test-eks-3yd9EsUB:profile1]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Still creating... [5m10s elapsed]
module.eks.module.fargate.aws_eks_fargate_profile.this["default"]: Creation complete after 5m15s [id=test-eks-3yd9EsUB:default]

Apply complete! Resources: 49 added, 0 changed, 0 destroyed.

Outputs:

cluster_endpoint = "https://A0C438BA337299C97493761B0C78632B.gr7.eu-west-1.eks.amazonaws.com"
cluster_security_group_id = "sg-0792d5490e6869910"
config_map_aws_auth = []
fargate_profile_arns = [
  "arn:aws:eks:eu-west-1:645945852371:fargateprofile/test-eks-3yd9EsUB/default/8ebe2107-5759-39ed-9346-cb4d0ce42cf1",
  "arn:aws:eks:eu-west-1:645945852371:fargateprofile/test-eks-3yd9EsUB/secondary/a0be2105-7d81-153d-482f-cca984a29599",
]
kubectl_config = <<EOT
apiVersion: v1
preferences: {}
kind: Config

clusters:
- cluster:
    server: https://A0C438BA337299C97493761B0C78632B.gr7.eu-west-1.eks.amazonaws.com
    certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1UQXdNakUzTWpJd05sb1hEVE14TURrek1ERTNNakl3Tmxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTDdZCk1xQ215dDVDak8zM1EvWlErTStTTVFBT2R5NGxvVGdqVkd0dWJjSWM2eEFLRU5JMDNrZThXQ201d1I1UTZtWTcKQ0EvamJRRHRsbTJWUld0NGc0cDNzUEdKTHRDTUtNK3VXNU9SVU1MZi9iUllRV0lqZ2gxcExNNk5WaUI2bk10Mgp5MkViUlpnWktvUjZ3eXlYRjhaVUNKNWlSWDdLelgvanJOY255VTRsa3M4aGUvcFlUSTFUdGkxMitNQmNXTmFEClFUanpHaWJ5aFBmUnBaNFZOZ1F0L3hoOTJsbEhjZWxPRmtYemdzZllNZTIzR280Q3E1cEhhRzA1QjVNNXY0REoKUHlpbHc4RW9KcXRsWFMzb3QzWUhMTkRwNVp5YmlYcHYwNFlZbnJHem9idEY3RjYvazhJVXZnbTBZbGdsRFBVNApkRENZc0ZpYUwxdHlxYk5MZ3kwQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZFQnJBdWZWRU8ybXFnQUZKZG5kazFmZ2JoTWNNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDTlRUMEFaSTRFNEx0ZnFOejJPS25mcEVLYVF2cDU4aHFDTnRrOFdaYlRmN1lvd1BZRQpXdDdYbUFncStIcGpRNFBuSS93dkdsemVobnMrQUZNZDRKeWFncjdlaXhZQVJWaGphVGZmWC9yNjJsbVRNVkJqCkZmMTlvcUdROC9ya1l4RHBZMUt4MmZkVHM2TWtkOTJ3VzcwSHBUUmRzcHRxZ1kybDFiQzFyWVkxTXVnRk5UVEcKY216Q29ZYVJhWlc3SEFyNFVPWERMOEdhVElKelhELzBtSmg2WGJKYmNIbHg2b2FUTkVHK2dwazZqN3NiaGNMeApCVmNlYWhGK0V5VDJXeHZDNW1oN2FQQy81TExVWTZROVFjNjBxS2pNRHVCYkc4d3EycGlML24xSmhOak1ObExZCnZHcjkwMFF5dnVYMEFFQ1JJNmhyQnhpcjVFdG9YZ3VZZmVZRAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
  name: eks_test-eks-3yd9EsUB

contexts:
- context:
    cluster: eks_test-eks-3yd9EsUB
    user: eks_test-eks-3yd9EsUB
  name: eks_test-eks-3yd9EsUB

current-context: eks_test-eks-3yd9EsUB

users:
- name: eks_test-eks-3yd9EsUB
  user:
    exec:
      apiVersion: client.authentication.k8s.io/v1alpha1
      command: aws-iam-authenticator
      args:
        - "token"
        - "-i"
        - "test-eks-3yd9EsUB"

EOT
/home/bmogilefsky/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/fargate # 
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0$ exit
```

</details>

(This is about as far as I'll take this on my side since this is an effective workaround for whatever the root cause might be.)